//
//  FilterStruct.swift
//  Joclinics
//
//  Created by Hussam Abuherra on 26/11/2021.
//

import Foundation

struct FilterStruct {
    var specializationList : [String] = ["الكل",
                                         "التوليد وأمراض النساء",
                                         "الأطفال",
                                         "طب عام",
                                         "الطب الباطني",
                                         "طب الأسنان",
                                         "طب وجراحة العظام",
                                         "أنف، أذن وحنجرة",
                                         "الأمراض الجلدية والتناسليه",
                                         "أمراض القلب",
                                         "امراض الصدرية والجهاز التنفسي",
                                         "جراحة التجميل",
                                         "طب وجراحة العيون",
                                         "طب الكلى والمسالك البولية",
                                         "الجهاز الهضمي",
                                         "طب الاسرة",
                                         "امراض المفاصل والروماتزم",
                                         "جراحة عامة",
                                         "الطب النفسي",
                                         "طب الاعصاب",
                                         "مرض السكري والغدد الصماء",
                                         "طب الأورام (السرطان)",
                                         "جراحة الأطفال",
                                         "جراحة المخ والأعصاب",
                                         "جراحة الصدر والرئتين",
                                         "جراحة المسالك البولية"
    ];
    var sortList : [String] = ["التقييم",
                               "الأقل سعر",
                               "الاعلى سعر",
                               "الأقرب"]
    var cityList : [String] = ["الكل",
                               "عمان",
                               "إربد",
                               "البلقاء",
                               "جرش",
                               "الزرقاء",
                               "الطفيلة",
                               "عجلون",
                               "العقبة",
                               "الكرك",
                               "مادبا",
                               "معان",
                               "المفرق"]
    
}
